{"generatedBy": "keras v2.2.4-tf", "format": "layers-model", "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"dtype": "float32", "name": "conv1/kernel", "shape": [3, 3, 3, 32]}, {"dtype": "float32", "name": "conv1_bn/gamma", "shape": [32]}, {"dtype": "float32", "name": "conv1_bn/beta", "shape": [32]}, {"dtype": "float32", "name": "conv1_bn/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "conv1_bn/moving_variance", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 32, 1]}, {"dtype": "float32", "name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "conv_dw_10_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_10_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_10_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_10_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "conv_dw_11_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "conv_dw_12_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 1024, 1]}, {"dtype": "float32", "name": "conv_dw_13_bn/gamma", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_13_bn/beta", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_13_bn/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_13_bn/moving_variance", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_1_bn/gamma", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1_bn/beta", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1_bn/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1_bn/moving_variance", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 64, 1]}, {"dtype": "float32", "name": "conv_dw_2_bn/gamma", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_2_bn/beta", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_2_bn/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_2_bn/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 128, 1]}, {"dtype": "float32", "name": "conv_dw_3_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_3_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_3_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_3_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 128, 1]}, {"dtype": "float32", "name": "conv_dw_4_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 256, 1]}, {"dtype": "float32", "name": "conv_dw_5_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_5_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_5_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_5_bn/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 256, 1]}, {"dtype": "float32", "name": "conv_dw_6_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6_bn/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_7/depthwise_kernel", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "conv_dw_7_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_7_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_7_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_7_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_8/depthwise_kernel", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "conv_dw_8_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_8_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_8_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_8_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_9/depthwise_kernel", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "conv_dw_9_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_9_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_9_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_9_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_1/kernel", "shape": [1, 1, 32, 64]}, {"dtype": "float32", "name": "conv_pw_10/kernel", "shape": [1, 1, 512, 512]}, {"dtype": "float32", "name": "conv_pw_10_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_10_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_10_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_10_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_11/kernel", "shape": [1, 1, 512, 512]}, {"dtype": "float32", "name": "conv_pw_11_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_11_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_11_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_11_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_12/kernel", "shape": [1, 1, 512, 1024]}, {"dtype": "float32", "name": "conv_pw_12_bn/gamma", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_12_bn/beta", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_12_bn/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_12_bn/moving_variance", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_13/kernel", "shape": [1, 1, 1024, 1024]}, {"dtype": "float32", "name": "conv_pw_13_bn/gamma", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_13_bn/beta", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_13_bn/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_13_bn/moving_variance", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_1_bn/gamma", "shape": [64]}, {"dtype": "float32", "name": "conv_pw_1_bn/beta", "shape": [64]}, {"dtype": "float32", "name": "conv_pw_1_bn/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "conv_pw_1_bn/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "conv_pw_2/kernel", "shape": [1, 1, 64, 128]}, {"dtype": "float32", "name": "conv_pw_2_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_2_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_2_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_2_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_3/kernel", "shape": [1, 1, 128, 128]}, {"dtype": "float32", "name": "conv_pw_3_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_3_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_3_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_3_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_4/kernel", "shape": [1, 1, 128, 256]}, {"dtype": "float32", "name": "conv_pw_4_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_4_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_4_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_4_bn/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_5/kernel", "shape": [1, 1, 256, 256]}, {"dtype": "float32", "name": "conv_pw_5_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_5_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_5_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_5_bn/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_6/kernel", "shape": [1, 1, 256, 512]}, {"dtype": "float32", "name": "conv_pw_6_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_6_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_6_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_6_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_7/kernel", "shape": [1, 1, 512, 512]}, {"dtype": "float32", "name": "conv_pw_7_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_7_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_7_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_7_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_8/kernel", "shape": [1, 1, 512, 512]}, {"dtype": "float32", "name": "conv_pw_8_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_8_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_8_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_8_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_9/kernel", "shape": [1, 1, 512, 512]}, {"dtype": "float32", "name": "conv_pw_9_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_9_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_9_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_9_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "dense/kernel", "shape": [1024, 7]}, {"dtype": "float32", "name": "dense/bias", "shape": [7]}]}], "modelTopology": {"keras_version": "2.2.4-tf", "training_config": {"optimizer_config": {"config": {"amsgrad": false, "beta_2": 0.9990000128746033, "lr": 0.009999999776482582, "beta_1": 0.8999999761581421, "decay": 0.0, "epsilon": 1e-07}, "class_name": "Adam"}, "sample_weight_mode": null, "loss_weights": null, "weighted_metrics": null, "metrics": ["categorical_accuracy", "top_2_accuracy", "top_3_accuracy"], "loss": "categorical_crossentropy"}, "backend": "tensorflow", "model_config": {"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1_pad", "config": {"dtype": "float32", "data_format": "channels_last", "name": "conv1_pad", "padding": [[0, 1], [0, 1]], "trainable": false}, "class_name": "ZeroPadding2D"}, {"inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "name": "conv1", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 32, "trainable": false, "kernel_size": [3, 3], "use_bias": false, "kernel_constraint": null, "name": "conv1", "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "conv1_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv1_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "name": "conv1_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv1_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "name": "conv_dw_1", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "trainable": false, "kernel_size": [3, 3], "use_bias": false, "name": "conv_dw_1", "padding": "same", "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "depth_multiplier": 1, "depthwise_constraint": null, "depthwise_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "name": "conv_dw_1_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_dw_1_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "name": "conv_dw_1_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_dw_1_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "name": "conv_pw_1", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 64, "trainable": false, "kernel_size": [1, 1], "use_bias": false, "kernel_constraint": null, "name": "conv_pw_1", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "name": "conv_pw_1_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_pw_1_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "name": "conv_pw_1_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_pw_1_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "name": "conv_pad_2", "config": {"dtype": "float32", "data_format": "channels_last", "name": "conv_pad_2", "padding": [[0, 1], [0, 1]], "trainable": false}, "class_name": "ZeroPadding2D"}, {"inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "name": "conv_dw_2", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [2, 2], "trainable": false, "kernel_size": [3, 3], "use_bias": false, "name": "conv_dw_2", "padding": "valid", "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "depth_multiplier": 1, "depthwise_constraint": null, "depthwise_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "name": "conv_dw_2_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_dw_2_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "name": "conv_dw_2_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_dw_2_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "name": "conv_pw_2", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 128, "trainable": false, "kernel_size": [1, 1], "use_bias": false, "kernel_constraint": null, "name": "conv_pw_2", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "name": "conv_pw_2_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_pw_2_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "name": "conv_pw_2_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_pw_2_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "name": "conv_dw_3", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "trainable": false, "kernel_size": [3, 3], "use_bias": false, "name": "conv_dw_3", "padding": "same", "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "depth_multiplier": 1, "depthwise_constraint": null, "depthwise_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "name": "conv_dw_3_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_dw_3_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "name": "conv_dw_3_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_dw_3_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "name": "conv_pw_3", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 128, "trainable": false, "kernel_size": [1, 1], "use_bias": false, "kernel_constraint": null, "name": "conv_pw_3", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "name": "conv_pw_3_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_pw_3_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "name": "conv_pw_3_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_pw_3_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "name": "conv_pad_4", "config": {"dtype": "float32", "data_format": "channels_last", "name": "conv_pad_4", "padding": [[0, 1], [0, 1]], "trainable": false}, "class_name": "ZeroPadding2D"}, {"inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "name": "conv_dw_4", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [2, 2], "trainable": false, "kernel_size": [3, 3], "use_bias": false, "name": "conv_dw_4", "padding": "valid", "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "depth_multiplier": 1, "depthwise_constraint": null, "depthwise_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "name": "conv_dw_4_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_dw_4_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "name": "conv_dw_4_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_dw_4_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "name": "conv_pw_4", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 256, "trainable": false, "kernel_size": [1, 1], "use_bias": false, "kernel_constraint": null, "name": "conv_pw_4", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "name": "conv_pw_4_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_pw_4_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "name": "conv_pw_4_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_pw_4_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "name": "conv_dw_5", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "trainable": false, "kernel_size": [3, 3], "use_bias": false, "name": "conv_dw_5", "padding": "same", "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "depth_multiplier": 1, "depthwise_constraint": null, "depthwise_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "name": "conv_dw_5_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_dw_5_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "name": "conv_dw_5_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_dw_5_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "name": "conv_pw_5", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 256, "trainable": false, "kernel_size": [1, 1], "use_bias": false, "kernel_constraint": null, "name": "conv_pw_5", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "name": "conv_pw_5_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_pw_5_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "name": "conv_pw_5_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_pw_5_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "name": "conv_pad_6", "config": {"dtype": "float32", "data_format": "channels_last", "name": "conv_pad_6", "padding": [[0, 1], [0, 1]], "trainable": false}, "class_name": "ZeroPadding2D"}, {"inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "name": "conv_dw_6", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [2, 2], "trainable": false, "kernel_size": [3, 3], "use_bias": false, "name": "conv_dw_6", "padding": "valid", "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "depth_multiplier": 1, "depthwise_constraint": null, "depthwise_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "name": "conv_dw_6_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_dw_6_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "name": "conv_dw_6_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_dw_6_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "name": "conv_pw_6", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 512, "trainable": false, "kernel_size": [1, 1], "use_bias": false, "kernel_constraint": null, "name": "conv_pw_6", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "name": "conv_pw_6_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_pw_6_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "name": "conv_pw_6_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_pw_6_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "name": "conv_dw_7", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "trainable": false, "kernel_size": [3, 3], "use_bias": false, "name": "conv_dw_7", "padding": "same", "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "depth_multiplier": 1, "depthwise_constraint": null, "depthwise_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "name": "conv_dw_7_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_dw_7_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "name": "conv_dw_7_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_dw_7_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "name": "conv_pw_7", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 512, "trainable": false, "kernel_size": [1, 1], "use_bias": false, "kernel_constraint": null, "name": "conv_pw_7", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "name": "conv_pw_7_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_pw_7_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "name": "conv_pw_7_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_pw_7_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "name": "conv_dw_8", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "trainable": false, "kernel_size": [3, 3], "use_bias": false, "name": "conv_dw_8", "padding": "same", "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "depth_multiplier": 1, "depthwise_constraint": null, "depthwise_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "name": "conv_dw_8_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_dw_8_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "name": "conv_dw_8_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_dw_8_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "name": "conv_pw_8", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 512, "trainable": false, "kernel_size": [1, 1], "use_bias": false, "kernel_constraint": null, "name": "conv_pw_8", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "name": "conv_pw_8_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_pw_8_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "name": "conv_pw_8_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_pw_8_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "name": "conv_dw_9", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "trainable": false, "kernel_size": [3, 3], "use_bias": false, "name": "conv_dw_9", "padding": "same", "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "depth_multiplier": 1, "depthwise_constraint": null, "depthwise_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "name": "conv_dw_9_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_dw_9_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "name": "conv_dw_9_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_dw_9_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "name": "conv_pw_9", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 512, "trainable": false, "kernel_size": [1, 1], "use_bias": false, "kernel_constraint": null, "name": "conv_pw_9", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "name": "conv_pw_9_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_pw_9_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "name": "conv_pw_9_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_pw_9_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "name": "conv_dw_10", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "trainable": false, "kernel_size": [3, 3], "use_bias": false, "name": "conv_dw_10", "padding": "same", "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "depth_multiplier": 1, "depthwise_constraint": null, "depthwise_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "name": "conv_dw_10_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_dw_10_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "name": "conv_dw_10_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_dw_10_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "name": "conv_pw_10", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 512, "trainable": false, "kernel_size": [1, 1], "use_bias": false, "kernel_constraint": null, "name": "conv_pw_10", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "name": "conv_pw_10_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_pw_10_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "name": "conv_pw_10_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_pw_10_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "name": "conv_dw_11", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "trainable": false, "kernel_size": [3, 3], "use_bias": false, "name": "conv_dw_11", "padding": "same", "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "depth_multiplier": 1, "depthwise_constraint": null, "depthwise_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "name": "conv_dw_11_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "name": "conv_dw_11_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "name": "conv_dw_11_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": false, "max_value": 6.0, "dtype": "float32", "name": "conv_dw_11_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "name": "conv_pw_11", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 512, "trainable": false, "kernel_size": [1, 1], "use_bias": false, "kernel_constraint": null, "name": "conv_pw_11", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "name": "conv_pw_11_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "name": "conv_pw_11_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "name": "conv_pw_11_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": true, "max_value": 6.0, "dtype": "float32", "name": "conv_pw_11_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "name": "conv_pad_12", "config": {"dtype": "float32", "data_format": "channels_last", "name": "conv_pad_12", "padding": [[0, 1], [0, 1]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "name": "conv_dw_12", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [2, 2], "trainable": true, "kernel_size": [3, 3], "use_bias": false, "name": "conv_dw_12", "padding": "valid", "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "depth_multiplier": 1, "depthwise_constraint": null, "depthwise_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "DepthwiseConv2D"}, {"inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "name": "conv_dw_12_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "name": "conv_dw_12_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "name": "conv_dw_12_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": true, "max_value": 6.0, "dtype": "float32", "name": "conv_dw_12_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "name": "conv_pw_12", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 1024, "trainable": true, "kernel_size": [1, 1], "use_bias": false, "kernel_constraint": null, "name": "conv_pw_12", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "name": "conv_pw_12_bn", "config": {"axis": [3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "name": "conv_pw_12_bn", "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "center": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "name": "conv_pw_12_relu", "config": {"threshold": 0.0, "negative_slope": 0.0, "trainable": true, "max_value": 6.0, "dtype": "float32", "name": "conv_pw_12_relu"}, "class_name": "ReLU"}, {"inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "name": "conv_dw_13", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "use_bias": false, "name": "conv_dw_13", "padding": "same", "depthwise_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "depth_multiplier": 1, "depthwise_constraint": null, 